app/Controllers/Anggota.php

SELECT *
FROM `anggota`
---
    public function index()
    {
        $data['anggota'] = $this->anggotaModel->findAll();

UPDATE `anggota` SET `gelar_depan` = 'H.', `nama_depan` = 'Oleh', `nama_belakang` = 'Soleh', `gelar_belakang` = 'S.H.', `jabatan` = 'Ketua', `status_pernikahan` = 'Cerai Mati', `jumlah_anak` = '1'
WHERE `anggota`.`id_anggota` IN ('108')
---
    public function update($id)
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'gelar_depan' => 'permit_empty|max_length[50]',
            'nama_depan' => 'required|max_length[100]',
            'nama_belakang' => 'required|max_length[100]',
            'gelar_belakang' => 'permit_empty|max_length[50]',
            'jabatan' => 'required|in_list[Ketua,Wakil Ketua,Anggota]',
            'status_pernikahan' => 'required|in_list[Kawin,Belum Kawin,Cerai Hidup,Cerai Mati]',
            'jumlah_anak' => 'permit_empty|integer|greater_than_equal_to[0]|less_than_equal_to[10]',
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        $data = [
            'gelar_depan' => $this->request->getPost('gelar_depan'),
            'nama_depan' => $this->request->getPost('nama_depan'),
            'nama_belakang' => $this->request->getPost('nama_belakang'),
            'gelar_belakang' => $this->request->getPost('gelar_belakang'),
            'jabatan' => $this->request->getPost('jabatan'),
            'status_pernikahan' => $this->request->getPost('status_pernikahan'),
            'jumlah_anak' => $this->request->getPost('jumlah_anak') ?? 0,
        ];

        try {
            $this->anggotaModel->update($id, $data);

INSERT INTO `komponen_gaji` (`id_komponen_gaji`, `nama_komponen`, `kategori`, `jabatan`, `nominal`, `satuan`) VALUES ('241', 'Tunjangan Alat Tulis', 'Tunjangan Lain', 'Semua', '50000000.00', 'Hari')
---
    public function saveKomponenGaji()
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'id_komponen_gaji' => 'required|integer|is_unique[komponen_gaji.id_komponen_gaji]',
            'nama_komponen'    => 'required|max_length[100]',
            'kategori'         => 'required|in_list[Gaji Pokok,Tunjangan Melekat,Tunjangan Lain]',
            'jabatan'          => 'required|in_list[Ketua,Wakil Ketua,Anggota,Semua]',
            'nominal'          => 'required|numeric|greater_than[0]',
            'satuan'           => 'required|in_list[Bulan,Hari,Periode]',
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        $data = [
            'id_komponen_gaji' => $this->request->getPost('id_komponen_gaji'),
            'nama_komponen'    => $this->request->getPost('nama_komponen'),
            'kategori'         => $this->request->getPost('kategori'),
            'jabatan'          => $this->request->getPost('jabatan'),
            'nominal'          => $this->request->getPost('nominal'),
            'satuan'           => $this->request->getPost('satuan'),
        ];

        try {
            $this->komponenGajiModel->insert($data);

SELECT *
FROM `komponen_gaji`
---
    public function lihatKomponenGaji()
    {
        $data['komponen'] = $this->komponenGajiModel->findAll();

SELECT `penggajian`.`id_anggota`, `penggajian`.`id_komponen_gaji`, `anggota`.`gelar_depan`, `anggota`.`nama_depan`, `anggota`.`nama_belakang`, `anggota`.`gelar_belakang`, `anggota`.`jabatan`, `komponen_gaji`.`nominal`
FROM `penggajian`
JOIN `anggota` ON `anggota`.`id_anggota` = `penggajian`.`id_anggota`
JOIN `komponen_gaji` ON `komponen_gaji`.`id_komponen_gaji` = `penggajian`.`id_komponen_gaji`
SELECT SUM(`komponen_gaji`.`nominal`) AS `nominal`
FROM `penggajian`
JOIN `komponen_gaji` ON `komponen_gaji`.`id_komponen_gaji` = `penggajian`.`id_komponen_gaji`
WHERE `penggajian`.`id_anggota` = '101'
---
    public function lihatPenggajian()
    {
        $builder = $this->db->table('penggajian')
                            ->join('anggota', 'anggota.id_anggota = penggajian.id_anggota')
                            ->join('komponen_gaji', 'komponen_gaji.id_komponen_gaji = penggajian.id_komponen_gaji')
                            ->select('penggajian.id_anggota, penggajian.id_komponen_gaji, anggota.gelar_depan, anggota.nama_depan, anggota.nama_belakang, anggota.gelar_belakang, anggota.jabatan, komponen_gaji.nominal');

        $data['penggajian'] = $builder->get()->getResultArray();

        // Kelompokkan dan hitung Take Home Pay per anggota
        $groupedPenggajian = [];
        foreach ($data['penggajian'] as $row) {
            $idAnggota = $row['id_anggota'];
            if (!isset($groupedPenggajian[$idAnggota])) {
                $groupedPenggajian[$idAnggota] = $row;
                $groupedPenggajian[$idAnggota]['take_home_pay'] = 0;
            }
            $totalNominal = $this->db->table('penggajian')
                                ->join('komponen_gaji', 'komponen_gaji.id_komponen_gaji = penggajian.id_komponen_gaji')
                                ->where('penggajian.id_anggota', $idAnggota)
                                ->selectSum('komponen_gaji.nominal')
                                ->get()
                                ->getRow()
                                ->nominal;

SELECT *
FROM `anggota`
WHERE `anggota`.`id_anggota` = '101'
SELECT `komponen_gaji`.`nama_komponen`, `komponen_gaji`.`kategori`, `komponen_gaji`.`nominal`, `komponen_gaji`.`satuan`
FROM `penggajian`
JOIN `komponen_gaji` ON `komponen_gaji`.`id_komponen_gaji` = `penggajian`.`id_komponen_gaji`
WHERE `penggajian`.`id_anggota` = '101'
SELECT SUM(`komponen_gaji`.`nominal`) AS `nominal`
FROM `penggajian`
JOIN `komponen_gaji` ON `komponen_gaji`.`id_komponen_gaji` = `penggajian`.`id_komponen_gaji`
WHERE `penggajian`.`id_anggota` = '101'
---
    public function detailPenggajian($idAnggota)
    {
        // Ambil data anggota
        $anggota = $this->anggotaModel->find($idAnggota);
        if (empty($anggota)) {
            return redirect()->to('/anggota/lihatPenggajian')->with('error', 'Data anggota tidak ditemukan');
        }

        // Ambil daftar komponen gaji yang dimiliki anggota ini
        $penggajian = $this->db->table('penggajian')
            ->join('komponen_gaji', 'komponen_gaji.id_komponen_gaji = penggajian.id_komponen_gaji')
            ->select('komponen_gaji.nama_komponen, komponen_gaji.kategori, komponen_gaji.nominal, komponen_gaji.satuan')
            ->where('penggajian.id_anggota', $idAnggota)
            ->get()
            ->getResultArray();

        // Hitung total take home pay
        $total = $this->db->table('penggajian')
            ->join('komponen_gaji', 'komponen_gaji.id_komponen_gaji = penggajian.id_komponen_gaji')
            ->where('penggajian.id_anggota', $idAnggota)
            ->selectSum('komponen_gaji.nominal')
            ->get()
            ->getRow()
            ->nominal ?? 0;