app/Controllers/Auth.php

    public function attemptLogin()
    {
        $model = new PenggunaModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `pengguna`
WHERE `email` = 'citizen@akses.com'
 LIMIT 1