app/Controllers/PublicController.php

SELECT *
FROM `anggota`
---
    public function anggota()
    {
        $data['anggota'] = $this->anggotaModel->findAll();